'''
Даете капчу, а он переводит его в обычную цифру
'''
nums = {
0: ('##', '##', '##', '##'),
1: ('.#', '##', '.#', '.#'),
2: ('##', '.#', '#.', '##'),
3: ('##', '.#', '.#', '##'),
4: ('##', '##', '.#', '.#'),
5: ('##', '#.', '.#','##'),
6: ('.#', '#.', '##','##'),
7: ('##', '.#', '#.', '#.'),
8: ('##', '..', '##', '##'),
9: ('##', '##', '.#', '#.')
}

def _1_(nums, alpha):
    for i in range(10):
        if list(nums[i]) == alpha:
            return i

alpha = []

for i in range(4):
    alpha.append(input())

print(_1_(nums, alpha))
